"""

Домашнее задание №1

Цикл for: Продажи товаров

* Дан список словарей с данными по колличеству проданных телефонов
  [
    {'product': 'iPhone 12', 'items_sold': [363, 500, 224, 358, 480, 476, 470, 216, 270, 388, 312, 186]}, 
    {'product': 'Xiaomi Mi11', 'items_sold': [317, 267, 290, 431, 211, 354, 276, 526, 141, 453, 510, 316]},
    {'product': 'Samsung Galaxy 21', 'items_sold': [343, 390, 238, 437, 214, 494, 441, 518, 212, 288, 272, 247]},
  ]
* Посчитать и вывести суммарное количество продаж для каждого товара
* Посчитать и вывести среднее количество продаж для каждого товара
* Посчитать и вывести суммарное количество продаж всех товаров
* Посчитать и вывести среднее количество продаж всех товаров
"""
products = [
    {'product': 'iPhone 12', 'items_sold': [363, 500, 224, 358, 480, 476, 470, 216, 270, 388, 312, 186]}, 
    {'product': 'Xiaomi Mi11', 'items_sold': [317, 267, 290, 431, 211, 354, 276, 526, 141, 453, 510, 316]},
    {'product': 'Samsung Galaxy 21', 'items_sold': [343, 390, 238, 437, 214, 494, 441, 518, 212, 288, 272, 247]},
  ]

if __name__ == "__main__":
    
  phones_sum = 0
  for one_phone in products:
      phones_total = sum(one_phone['items_sold'])
      print(f'Суммарное количество продаж {one_phone["product"]}: {phones_total}')
      phones_sum += phones_total
      phone_mean = int(phones_total / len(one_phone['items_sold']))
      print(f'Среднее количество продаж для {one_phone["product"]}: {phone_mean}')
      
  phones_mean = phones_sum / len(products)
  print(f'Суммарное количество продаж всех телефонов: {phones_sum}')
  print(f'Среднее количество продаж всех товаров: {phones_mean}')
